shakilapr/etrike/rt-esp32/test/test_running_faults_and_recovery/test_running_faults_and_recovery.cpp
#include <unity.h>
#include <cstdint>
#include <cstring>
#include <cmath>
#include <vector>
#include <algorithm>

#include "stub/stm32g4xx_hal.h"
#include "protocol/compat/can.hpp"
#include "protocol/generated/cpp/etrike_protocol.hpp"
#include "protocol/codecs/ses.hpp"
#include "protocol/codecs/seb.hpp"

#include "physics_model.h"
#include "brake_arbitration.h"
#include "seb_request.h"
#include "watchdog.h"
#include "config.h"
#include "shared_config.h"

#include "motor_manager.h"
#include "relay_controller.h"
#include "dac_controller.h"

using namespace rt;
using namespace mtr;

namespace {

// ── Complete Multi-ECU Simulated Running Test Environment ─────────
class RunningFaultSystemHarness {
public:
    uint32_t now_ms{100};

    // Dual CAN Network Simulation
    std::vector<can::Frame> high_bus_rx{};
    std::vector<can::Frame> low_bus_rx{};

    // ── SYS Node State ───────────────────────────────────────────
    uint8_t   sys_mode_ctr{0};
    uint8_t   sys_pwr_ctr{0};
    uint8_t   sys_safety_ctr{0};
    uint8_t   sys_hb_ctr{0};
    bool      sys_estop_latch{false};
    can::Mode sys_current_mode{can::Mode::Manual};
    bool      sys_power_on{false};

    // Fault Injection Flags on SYS
    bool      enable_sys_hb{true};
    bool      enable_sys_safety{true};
    bool      enable_sys_mode{true};
    bool      enable_sys_pwr{true};
    bool      corrupt_safety_crc{false};
    bool      freeze_mode_counter{false};
    bool      jump_pwr_counter{false};

    // ── Host / Jetson Node State ─────────────────────────────────
    uint8_t   host_hb_ctr{0};
    int32_t   host_cmd_speed_mmps{0};
    int32_t   host_cmd_yaw_mrad_s{0};
    uint8_t   host_cmd_gear{1}; // Drive
    bool      enable_host_hb{true};
    bool      enable_host_drive{true};

    // ── RT ESP32 Node State & Subsystems ─────────────────────────
    PhysicsModel     rt_physics{};
    CmdWatchdog      rt_watchdog{};
    can::Mode        rt_mode{can::Mode::Manual};
    int64_t          rt_last_sys_hb_us{0};
    int64_t          rt_last_host_hb_us{0};
    bool             rt_estop_active{false};
    uint8_t          rt_estop_reason{rt::kEstopReasonNone};
    uint8_t          rt_estop_clear_count{0};
    uint8_t          rt_estop_last_zero_ctr{0};
    int32_t          rt_last_resolved_speed{0};
    int32_t          rt_last_resolved_steer_mdeg{0};
    bool             rt_reversing{false};

    // RT Safety Monitor Emulated State
    int64_t          rt_last_mtr_feedback_us{-1};
    int64_t          rt_last_nonzero_cmd_us{-1};
    int32_t          rt_brake_request_kpa{0};
    bool             rt_disable_steering{false};
    bool             rt_obstacle_triggered{false};
    int              rt_steer_follow_err_ticks{0};

    // ── MTR STM32 Subsystems ─────────────────────────────────────
    RelayController  mtr_relays{};
    DacController    mtr_dac{};
    MotorManager     mtr_manager{mtr_relays, mtr_dac};

    // ── Smart Actuator States (SES Steering & SEB Brake) ────────
    int16_t          ses_actual_angle_0_1deg{0};
    bool             ses_jammed{false};
    int16_t          ses_jammed_angle_0_1deg{0};
    uint8_t          ses_last_rolling_ctr{0};
    bool             ses_checksum_valid{false};
    uint32_t         ses_frames_received{0};

    uint8_t          seb_pressure_raw{0};
    uint16_t         seb_stroke_raw{0};
    bool             seb_auto_brake_active{false};

    void init() {
        hal_mock::reset();
        mtr_manager.init();
        rt_watchdog.init();
    }

    void advance_time(uint32_t dt_ms) {
        now_ms += dt_ms;
        mtr_manager.tick(now_ms);
    }

    // Establish active cruise state: 2000 mm/s in AUTO mode
    void establish_active_cruise(int32_t speed_mmps = 2000, int32_t yaw_mrad_s = 0) {
        sys_power_on = true;
        sys_current_mode = can::Mode::Auto;
        sys_estop_latch = false;
        enable_sys_hb = true;
        enable_sys_safety = true;
        enable_sys_mode = true;
        enable_sys_pwr = true;
        enable_host_hb = true;
        enable_host_drive = true;

        // Establish authority streams
        for (int i = 0; i < 5; ++i) {
            advance_time(10);
            sys_broadcast_tick();
        }

        // Engage autonomous cruise
        for (int i = 0; i < 5; ++i) {
            advance_time(10);
            sys_broadcast_tick();
            host_broadcast_tick(speed_mmps, yaw_mrad_s);
            mtr_feedback_tick();
        }
    }

    // ── SYS Broadcasts ───────────────────────────────────────────
    void sys_broadcast_tick() {
        // 1. SYS Heartbeat (0x7FE, 10 Hz)
        if (enable_sys_hb) {
            can::gen::SysHeartbeat hb{};
            hb.alive_ctr = sys_hb_ctr++;
            hb.estop_active = sys_estop_latch;
            can::Frame f_hb{};
            can::gen::encode_sys_heartbeat(hb, f_hb);
            deliver_to_rt(f_hb, /*from_high=*/false);
            mtr_manager.handle_frame(f_hb, now_ms);
        }

        // 2. SYS Safety Status (0x011, 5 Hz with E2E CRC)
        if (enable_sys_safety) {
            can::gen::SysSafetySts safe{};
            safe.estop_active = sys_estop_latch;
            safe.heartbeat_ok = true;
            safe.rolling_counter = sys_safety_ctr++;
            safe.e2e_crc = 0;
            can::Frame tmp{};
            can::gen::encode_sys_safety_sts(safe, tmp);
            if (corrupt_safety_crc) {
                safe.e2e_crc = 0xAA; // deliberately corrupted CRC
            } else {
                safe.e2e_crc = static_cast<std::uint8_t>(can::e2e::sys_safety_sts_crc(tmp.data.data()));
            }
            can::Frame f_safe{};
            can::gen::encode_sys_safety_sts(safe, f_safe);
            deliver_to_rt(f_safe, /*from_high=*/false);
            mtr_manager.handle_frame(f_safe, now_ms);
        }

        // 3. SYS Mode Command (0x110, 10 Hz)
        if (enable_sys_mode) {
            can::gen::SysModeCmd mode{};
            mode.mode = (sys_current_mode == can::Mode::Auto);
            if (freeze_mode_counter) {
                mode.rolling_counter = sys_mode_ctr; // repeated/frozen counter
            } else {
                mode.rolling_counter = ++sys_mode_ctr;
            }
            can::Frame f_mode{};
            can::gen::encode_sys_mode_cmd(mode, f_mode);
            deliver_to_rt(f_mode, /*from_high=*/false);
            mtr_manager.handle_frame(f_mode, now_ms);
        }

        // 4. SYS Power Command (0x113, 10 Hz)
        if (enable_sys_pwr) {
            can::gen::SysPwrCmd pwr{};
            pwr.power_state = sys_power_on;
            if (jump_pwr_counter) {
                sys_pwr_ctr += 5; // counter jump/gap
                jump_pwr_counter = false;
            }
            pwr.rolling_counter = sys_pwr_ctr++;
            can::Frame f_pwr{};
            can::gen::encode_sys_pwr_cmd(pwr, f_pwr);
            deliver_to_rt(f_pwr, /*from_high=*/false);
            mtr_manager.handle_frame(f_pwr, now_ms);
        }
    }

    // ── Host Broadcasts ──────────────────────────────────────────
    void host_broadcast_tick(int32_t speed_mmps, int32_t yaw_mrad_s, int32_t brake_kpa = 0, uint32_t obstacle_mm = 3000) {
        host_cmd_speed_mmps = speed_mmps;
        host_cmd_yaw_mrad_s = yaw_mrad_s;

        // 1. Host Heartbeat (0x7FC, 2 Hz)
        if (enable_host_hb) {
            can::gen::HostHeartbeat hb{};
            hb.alive_ctr = host_hb_ctr++;
            hb.health_flags = 0;
            can::Frame f_hb{};
            can::gen::encode_host_heartbeat(hb, f_hb);
            deliver_to_rt(f_hb, /*from_high=*/true);
        }

        // 2. Host Obstacle Distance (0x400) - Sensor input processed before motion commands
        if (obstacle_mm < 3000) {
            can::gen::HostObstacleDist obs{};
            obs.distance_mm = obstacle_mm;
            can::Frame f_obs{};
            can::gen::encode_host_obstacle_dist(obs, f_obs);
            deliver_to_rt(f_obs, /*from_high=*/true);
        }

        // 3. Host Drive Command (0x300, 50 Hz)
        if (enable_host_drive) {
            can::gen::HostDriveCmd cmd{};
            cmd.speed_mmps = speed_mmps;
            cmd.yaw_rate_mrad_s = yaw_mrad_s;
            cmd.gear = host_cmd_gear;
            can::Frame f_cmd{};
            can::gen::encode_host_drive_cmd(cmd, f_cmd);
            deliver_to_rt(f_cmd, /*from_high=*/true);
        }

