shakilapr/etrike/rt-esp32/test/test_running_faults_and_recovery/test_running_faults_and_recovery.cpp
        // 4. Host Brake Request (0x301)
        if (brake_kpa > 0) {
            can::gen::HostBrakeReq brk{};
            brk.brake_pressure_kpa = brake_kpa;
            can::Frame f_brk{};
            can::gen::encode_host_brake_req(brk, f_brk);
            deliver_to_rt(f_brk, /*from_high=*/true);
        }
    }

    // ── MTR Feedback Broadcast (0x206) ───────────────────────────
    void mtr_feedback_tick() {
        int64_t now_us = static_cast<int64_t>(now_ms) * 1000;
        can::Frame f_fbk = mtr_manager.build_motor_feedback_frame();
        deliver_to_rt(f_fbk, /*from_high=*/false);
        rt_last_mtr_feedback_us = now_us;
    }

    // ── RT Gateway & Execution Engine ────────────────────────────
    void deliver_to_rt(const can::Frame& f, bool from_high) {
        int64_t now_us = static_cast<int64_t>(now_ms) * 1000;

        // Gateway forwarding
        if (from_high && can::is_forwarded_high_to_low(f.id)) {
            low_bus_rx.push_back(f);
        }
        if (!from_high && can::is_forwarded_low_to_high(f.id)) {
            high_bus_rx.push_back(f);
        }

        // Process 0x001 Hardwired ESTOP
        if (f.id == can::kIdSafetyEstop) {
            rt_estop_active = true;
            rt_estop_reason = rt::kEstopReasonCanEstop;
            if (from_high) low_bus_rx.push_back(f);
            else high_bus_rx.push_back(f);
            mtr_manager.handle_frame(f, now_ms);
            return;
        }

        // Process 0x011 SYS Safety Status
        if (f.id == can::kIdSysSafetySts && !from_high) {
            can::gen::SysSafetySts s{};
            can::gen::decode_sys_safety_sts(f.view(), s);
            if (s.estop_active) {
                rt_estop_active = true;
                rt_estop_reason = rt::kEstopReasonCanEstop;
                rt_estop_clear_count = 0;
            } else if (rt_estop_active) {
                // Asymmetric clear logic
                if (rt_estop_clear_count == 0) {
                    rt_estop_clear_count = 1;
                    rt_estop_last_zero_ctr = s.rolling_counter;
                } else if (s.rolling_counter == static_cast<uint8_t>(rt_estop_last_zero_ctr + 1)) {
                    ++rt_estop_clear_count;
                    if (rt_estop_clear_count >= 2) {
                        rt_estop_active = false;
                        rt_estop_reason = rt::kEstopReasonNone;
                        rt_estop_clear_count = 0;
                    }
                } else {
                    rt_estop_clear_count = 1;
                    rt_estop_last_zero_ctr = s.rolling_counter;
                }
            }
        }

        // Process 0x110 SYS Mode Command
        if (f.id == can::kIdSysModeCmd && !from_high) {
            can::gen::SysModeCmd mode_cmd{};
            if (can::gen::decode_sys_mode_cmd(f.view(), mode_cmd) == can::gen::CodecStatus::Ok) {
                rt_mode = mode_cmd.mode ? can::Mode::Auto : can::Mode::Manual;
            }
        }

        if (f.id == can::kIdHostHeartbeat && from_high) {
            rt_last_host_hb_us = now_us;
        }
        if (f.id == can::kIdSysHeartbeat && !from_high) {
            rt_last_sys_hb_us = now_us;
        }

        // Process 0x202 SES ErrorInfo (L3 fault bits)
        if (f.id == can::kIdSbwErrInfo && !from_high) {
            can::custom::ses::ErrorInfo error{};
            if (can::custom::ses::decode_error_info(f.view(), error) == can::gen::CodecStatus::Ok) {
                uint8_t angle_faults  = error.raw[1] & 0x0F;
                uint8_t torque_faults = (error.raw[2] >> 2) & 0x0F;
                if (angle_faults || torque_faults) {
                    rt_estop_active = true;
                    rt_estop_reason = rt::kEstopReasonInternal;
                    rt_brake_request_kpa = shared::kMaxBrakeKpa;
                    rt_disable_steering = true;
                }
            }
        }

        // Process 0x721 SEB Status (L3 error status == 3)
        if (f.id == can::kIdBbwStatus && !from_high) {
            can::custom::seb::Status val{};
            if (can::custom::seb::decode_status(f.view(), val) == can::gen::CodecStatus::Ok) {
                if (val.error_status == 3) {
                    rt_estop_active = true;
                    rt_estop_reason = rt::kEstopReasonInternal;
                    rt_brake_request_kpa = shared::kMaxBrakeKpa;
                }
            }
        }

        // Process 0x400 Obstacle Distance
        if (f.id == can::kIdHostObstacleDist && from_high) {
            can::gen::HostObstacleDist obs{};
            if (can::gen::decode_host_obstacle_dist(f.view(), obs) == can::gen::CodecStatus::Ok) {
                if (obs.distance_mm <= shared::kObstacleStopMM &&
                    std::abs(rt_last_resolved_speed) > static_cast<int32_t>(shared::kLowSpeedThreshMmps)) {
                    rt_obstacle_triggered = true;
                    rt_disable_steering = true;
                    rt_estop_reason = rt::kEstopReasonObstacle;
                    rt_brake_request_kpa = shared::kMaxBrakeKpa;
                } else if (obs.distance_mm > shared::kObstacleStopMM) {
                    rt_obstacle_triggered = false;
                    rt_disable_steering = false;
                    if (rt_estop_reason == rt::kEstopReasonObstacle) {
                        rt_estop_reason = rt::kEstopReasonNone;
                        rt_brake_request_kpa = 0;
                    }
                }
            }
        }

        // Process 0x300 Host Drive Command
        if (f.id == can::kIdHostDriveCmd && from_high) {
            rt_watchdog.feed(now_us);
            can::gen::HostDriveCmd cmd{};
            can::gen::decode_host_drive_cmd(f.view(), cmd);

            // Execute RT Kinematics
            DriveCmd drive_cmd{cmd.speed_mmps, cmd.yaw_rate_mrad_s};
            ResolvedSetpoint sp{};
            rt_physics.resolve(drive_cmd, sp);

            rt_last_resolved_speed = sp.motor_speed_mmps;
            rt_last_resolved_steer_mdeg = sp.steer_angle_mdeg;
            rt_reversing = sp.reversing;

