shakilapr/etrike/rt-esp32/test/test_running_faults_and_recovery/test_running_faults_and_recovery.cpp
            // ── Steering Following-Error Supervision (100 Hz check) ──
            int16_t cmd_angle_0_1deg = static_cast<int16_t>(sp.steer_angle_mdeg / 100);
            int16_t actual_angle_0_1deg = ses_jammed ? ses_jammed_angle_0_1deg : ses_actual_angle_0_1deg;
            int32_t diff = std::abs(static_cast<int32_t>(cmd_angle_0_1deg) - static_cast<int32_t>(actual_angle_0_1deg));
            float threshold_deg = rt::compute_following_error_threshold(static_cast<float>(std::abs(sp.motor_speed_mmps)));
            int32_t threshold_0_1deg = static_cast<int32_t>(threshold_deg * 10.0f);

            if (diff > threshold_0_1deg) {
                rt_steer_follow_err_ticks++;
                constexpr int kTickLimit = rt::kSteerFollowingErrMs / (1000 / rt::kControlLoopHz); // 300ms / 10ms = 30 ticks
                if (rt_steer_follow_err_ticks >= kTickLimit) {
                    rt_estop_active = true;
                    rt_estop_reason = rt::kEstopReasonFollowingError;
                    rt_brake_request_kpa = shared::kMaxBrakeKpa;
                    rt_disable_steering = true;
                }
            } else {
                rt_steer_follow_err_ticks = 0;
            }

            // Gating: motion prohibited if estopped or obstacle triggered or not AUTO
            const bool drive_allowed = (rt_mode == can::Mode::Auto) && !rt_estop_active && !rt_obstacle_triggered;
            int32_t speed_out = drive_allowed ? sp.motor_speed_mmps : 0;
            if (speed_out != 0) {
                rt_last_nonzero_cmd_us = now_us;
            }

            can::Gear gear;
            if (!drive_allowed) {
                gear = can::Gear::N;
            } else if (speed_out > 0) {
                gear = can::Gear::D;
            } else if (speed_out < 0) {
                gear = can::Gear::R;
            } else {
                gear = can::Gear::N;
            }

            // Send 0x204 to MTR
            can::gen::RtDriveCmd drv{speed_out, static_cast<uint8_t>(gear)};
            can::Frame f_204{};
            can::gen::encode_rt_drive_cmd(drv, f_204);
            mtr_manager.handle_frame(f_204, now_ms);
            mtr_manager.tick(now_ms);

            // Send 0x169 to SES (suppressed in Manual mode)
            if (rt_mode != can::Mode::Manual) {
                etrike::protocol::codecs::ses::Command ses_cmd{};
                ses_cmd.alignment_enable = true;
                ses_cmd.control_enable = (!rt_estop_active && !rt_disable_steering);
                ses_cmd.target_angle_raw = cmd_angle_0_1deg;
                ses_cmd.target_speed_raw = 328;
                ses_cmd.rolling_counter = ses_last_rolling_ctr++;

                can::Frame f_169{};
                etrike::protocol::codecs::ses::encode_command(ses_cmd, f_169);
                receive_ses_command(f_169);
            }
        }

        // Process 0x301 Host Brake Request
        if (f.id == can::kIdHostBrakeReq && from_high) {
            can::gen::HostBrakeReq brk{};
            can::gen::decode_host_brake_req(f.view(), brk);
            int32_t effective_brake = std::max(static_cast<int32_t>(brk.brake_pressure_kpa), rt_brake_request_kpa);
            auto seb_cmd = make_seb_auto_req(effective_brake);
            can::Frame f_7b9{};
            etrike::protocol::codecs::seb::encode_command(seb_cmd, f_7b9);
            receive_seb_command(f_7b9);
        }
    }

    void receive_ses_command(const can::Frame& f) {
        ses_frames_received++;
        uint8_t cs = 0;
        for (size_t i = 0; i < 7; ++i) cs ^= f.data[i];
        cs ^= 0xFF;
        ses_checksum_valid = (f.data[7] == cs);

        etrike::protocol::codecs::ses::Command cmd{};
        etrike::protocol::codecs::ses::decode_command(f.view(), cmd);
        if (!ses_jammed) {
            ses_actual_angle_0_1deg = cmd.target_angle_raw;
        }
    }

    void receive_seb_command(const can::Frame& f) {
        etrike::protocol::codecs::seb::Command cmd{};
        etrike::protocol::codecs::seb::decode_command(f.view(), cmd);
        seb_pressure_raw = cmd.pressure_request_raw;
        seb_stroke_raw = cmd.stroke_request_raw;
        seb_auto_brake_active = (cmd.auto_brake != 0);
    }
};

} // anonymous namespace

void setUp(void) {}
void tearDown(void) {}

// ── Test 1: Physical E-Stop Button Press & REARM Sequence While Cruising ──
void test_running_fault_estop_button_and_full_rearm_recovery(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    // Verify initial active cruise state: Relays Drive, DAC 1544 (~1.88V)
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());
    TEST_ASSERT_FALSE(s.rt_estop_active);

    // 1. Driver hits physical E-Stop button on dashboard while cruising at 2000 mm/s!
    s.sys_estop_latch = true;
    can::Frame f_001{can::kIdSafetyEstop, 0, {}};
    s.deliver_to_rt(f_001, /*from_high=*/false);
    s.sys_broadcast_tick();
    s.advance_time(10);

    // Immediate shutdown verified across nodes
    TEST_ASSERT_TRUE(s.rt_estop_active);
    TEST_ASSERT_EQUAL(rt::kEstopReasonCanEstop, s.rt_estop_reason);
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // 2. Driver pulls E-Stop button out (stops asserting 0x001, SYS sends estop_active=0)
    s.sys_estop_latch = false;

    // Frame 1 of estop_active=0: Latch MUST NOT clear (asymmetric clear guard)
    s.sys_broadcast_tick();
    s.advance_time(10);
    TEST_ASSERT_TRUE(s.rt_estop_active);
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());

    // Frame 2 of estop_active=0 with counter +1: Latch clears on RT & MTR!
    s.sys_broadcast_tick();
    s.advance_time(10);
    TEST_ASSERT_FALSE(s.rt_estop_active);

    // 3. REARM GATE CHECK: Autonomous drive command arrives before REARM sequence
    s.host_broadcast_tick(2000, 0);
    s.advance_time(10);
    // Vehicle MUST remain completely stopped!
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

