shakilapr/etrike/rt-esp32/test/test_running_faults_and_recovery/test_running_faults_and_recovery.cpp
    // 4. Execute Complete REARM Sequence:
    // Step 4a: Mode AUTO confirmed (0x110 sent twice)
    s.sys_current_mode = can::Mode::Auto;
    s.sys_broadcast_tick();
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.advance_time(10);

    // Step 4b: Power OFF edge (0x113=false sent twice)
    s.sys_power_on = false;
    s.sys_broadcast_tick();
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.advance_time(10);

    // Step 4c: Power ON edge (0x113=true sent twice)
    s.sys_power_on = true;
    s.sys_broadcast_tick();
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.advance_time(10);

    // 5. Propulsion successfully resumes!
    s.host_broadcast_tick(2000, 0);
    s.advance_time(10);
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());
}

// ── Test 2: SYS Safety Status (0x011) CRC Corruption & Auto-Recovery ──────
void test_running_fault_sys_safety_crc_corruption_and_recovery(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2200, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1628, s.mtr_dac.current_code());

    // Corrupt E2E CRC on SYS_SAFETY_STS (0x011) while running
    s.corrupt_safety_crc = true;
    s.sys_broadcast_tick();
    s.advance_time(10);

    // Motor manager immediately invalidates safety_state_valid_ and cuts throttle
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Bus noise clears: SYS sends clean frames with valid CRC and sequential counters
    s.corrupt_safety_crc = false;
    for (int i = 0; i < 3; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2200, 0);
    }

    // Stream authority self-heals: propulsion restores smoothly
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1628, s.mtr_dac.current_code());
}

// ── Test 3: Rolling Counter Freeze on Mode Command (0x110) ────────
void test_running_fault_mode_stream_counter_freeze_and_recovery(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // Freeze SYS mode rolling counter while driving (repeats same counter)
    s.freeze_mode_counter = true;
    // Advance 550 ms (exceeding kAuthFreshMs = 500 ms) while counter remains frozen
    for (int i = 0; i < 55; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2000, 0);
    }

    // Stream freshness fails due to frozen counter -> drive command unauthorized -> zero throttle
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Counter resumes normal advancing sequence
    s.freeze_mode_counter = false;
    for (int i = 0; i < 4; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2000, 0);
    }

    // Mode authority restored -> throttle restored
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());
}

// ── Test 4: Rolling Counter Jump / Gap on Power Command (0x113) ────
void test_running_fault_power_stream_counter_jump_and_recovery(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // Induce counter gap (+5) on power stream
    s.jump_pwr_counter = true;
    s.sys_broadcast_tick();
    s.advance_time(10);

    // Power validity immediately invalidated -> relays open to Off, DAC to 0
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Normal sequential frames resume
    for (int i = 0; i < 3; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2000, 0);
    }

    // Power validity restored -> relays re-engage
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());
}

// ── Test 5: Steering Following-Error (Actuator Jam) & ESTOP ────────
void test_running_fault_steering_following_error_and_estop(void) {
    RunningFaultSystemHarness s{};
    s.init();
    // Cruising at 2000 mm/s with 0° steer
    s.establish_active_cruise(2000, 0);
    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // Host commands turn: yaw rate 250 mrad/s -> requests ~10.4° steer (104 raw in 0.1°)
    // Actuator jams at 0°!
    s.ses_jammed = true;
    s.ses_jammed_angle_0_1deg = 0;

    // Error (10.4° - 0° = 10.4°) exceeds threshold at 2000 mm/s (~8.0°)
    // Advance 250 ms (less than 300 ms persist threshold): must NOT trip yet
    for (int i = 0; i < 25; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2000, 250);
    }
    TEST_ASSERT_FALSE(s.rt_estop_active);

    // Advance 60 ms more (total 310 ms > 300 ms kSteerFollowingErrMs): MUST TRIP!
    for (int i = 0; i < 6; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick();
        s.host_broadcast_tick(2000, 250);
    }

    // Following-Error ESTOP verified
    TEST_ASSERT_TRUE(s.rt_estop_active);
    TEST_ASSERT_EQUAL(rt::kEstopReasonFollowingError, s.rt_estop_reason);
    TEST_ASSERT_TRUE(s.rt_disable_steering);
    TEST_ASSERT_EQUAL(shared::kMaxBrakeKpa, s.rt_brake_request_kpa);

    // MTR propulsion is cut (speed output forced 0, relays Park/Neutral)
    TEST_ASSERT_EQUAL(RelayController::State::Park, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());
}

// ── Test 6: Sudden Obstacle Inside Stop Distance & Clearance ───────
void test_running_fault_obstacle_collision_imminent_and_clearance(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // Sudden obstacle detected at 200 mm (<= 300 mm kObstacleStopMM) while moving at 2000 mm/s
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.host_broadcast_tick(2000, 0, /*brake=*/0, /*obstacle=*/200);

