shakilapr/etrike/rt-esp32/test/test_running_faults_and_recovery/test_running_faults_and_recovery.cpp
    // Collision danger reaction verified
    TEST_ASSERT_TRUE(s.rt_obstacle_triggered);
    TEST_ASSERT_TRUE(s.rt_disable_steering);
    TEST_ASSERT_EQUAL(rt::kEstopReasonObstacle, s.rt_estop_reason);
    TEST_ASSERT_EQUAL(shared::kMaxBrakeKpa, s.rt_brake_request_kpa);

    // Propulsion forced zero
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Obstacle clears (distance jumps to 2500 mm)
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.host_broadcast_tick(2000, 0, /*brake=*/0, /*obstacle=*/2500);

    // Obstacle emergency clears
    TEST_ASSERT_FALSE(s.rt_obstacle_triggered);
    TEST_ASSERT_FALSE(s.rt_disable_steering);
    TEST_ASSERT_EQUAL(rt::kEstopReasonNone, s.rt_estop_reason);
}

// ── Test 7: Smart Actuator L3 Fatal Error (SES 0x202 & SEB 0x721) ──
void test_running_fault_actuator_l3_fault_estop(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // SES sends 0x202 with torque fault bit set
    can::Frame f_202{};
    f_202.id = can::kIdSbwErrInfo;
    f_202.dlc = 8;
    f_202.data.fill(0);
    f_202.data[2] = (1 << 2); // torque_faults = 1
    s.deliver_to_rt(f_202, /*from_high=*/false);

    // RT trips kEstopReasonInternal immediately
    TEST_ASSERT_TRUE(s.rt_estop_active);
    TEST_ASSERT_EQUAL(rt::kEstopReasonInternal, s.rt_estop_reason);
    TEST_ASSERT_EQUAL(shared::kMaxBrakeKpa, s.rt_brake_request_kpa);
}

// ── Test 8: Dedicated 0x204 Watchdog Trip & 3-Frame Recovery ───────
void test_running_fault_dedicated_0x204_watchdog_and_3_frame_recovery(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code());

    // RT drive generation freezes: silence on 0x204 while other nodes continue
    // Advance 220 ms (> 200 ms kDriveCmdTimeoutMs)
    for (int i = 0; i < 22; ++i) {
        s.advance_time(10);
        s.sys_broadcast_tick(); // generic comms fed
        // No host drive tick (no 0x204 sent)
    }

    // Dedicated watchdog trips -> DAC dropped to 0
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Send single 0x204 frame: trip MUST remain latched!
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame f_204{};
    can::gen::encode_rt_drive_cmd(drv, f_204);

    s.mtr_manager.handle_frame(f_204, s.now_ms);
    s.mtr_manager.tick(s.now_ms);
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code()); // still 0

    // Send 2nd frame: still latched
    s.advance_time(10);
    s.mtr_manager.handle_frame(f_204, s.now_ms);
    s.mtr_manager.tick(s.now_ms);
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code()); // still 0

    // Send 3rd frame at cadence: confirmed recovery (kDriveCmdRecoverFrames = 3)!
    s.advance_time(10);
    s.mtr_manager.handle_frame(f_204, s.now_ms);
    s.mtr_manager.tick(s.now_ms);
    TEST_ASSERT_EQUAL(1544, s.mtr_dac.current_code()); // restored!
}

// ── Test 9: Sudden Reverse Inversion Guard at Speed (50ms Dwell) ───
void test_running_fault_sudden_reverse_inversion_guard_at_speed(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2500, 0);

    TEST_ASSERT_EQUAL(RelayController::State::Drive, s.mtr_relays.state());

    // While cruising forward at 2500 mm/s, sudden reverse command arrives
    s.advance_time(10);
    s.sys_broadcast_tick();
    s.host_broadcast_tick(-500, 0);

    // Contactor arc protection dwell MUST engage immediately
    // Relays shifted to Neutral/Park, DAC forced to 0
    TEST_ASSERT_EQUAL(RelayController::State::Park, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Advance 40 ms (less than 50 ms dwell): reverse relay still blocked
    s.advance_time(40);
    s.mtr_manager.tick(s.now_ms);
    TEST_ASSERT_EQUAL(RelayController::State::Park, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());

    // Advance 20 ms more (total 60 ms > 50 ms): dwell complete, reverse safely engages!
    s.advance_time(20);
    s.sys_broadcast_tick();
    s.host_broadcast_tick(-500, 0);
    TEST_ASSERT_EQUAL(RelayController::State::Reverse, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(1966, s.mtr_dac.current_code()); // 100% reverse throttle
}

// ── Test 10: Low CAN Bus-Off Event & Cross-Bus Alert ──────────────
void test_running_fault_low_can_bus_off_cross_bus_alert(void) {
    RunningFaultSystemHarness s{};
    s.init();
    s.establish_active_cruise(2000, 0);

    size_t high_bus_before = s.high_bus_rx.size();

    // Low CAN transceiver hardware asserts bus-off
    // RT can_health triggers: sets kEstopReasonBusOff, enqueues ESTOP, broadcasts 0x001 on High CAN
    s.rt_estop_active = true;
    s.rt_estop_reason = rt::kEstopReasonBusOff;

    can::Frame f_001{};
    f_001.id = can::kIdSafetyEstop;
    f_001.dlc = 0;
    // Broadcast on High CAN
    s.high_bus_rx.push_back(f_001);
    // Also cut MTR
    s.mtr_manager.handle_frame(f_001, s.now_ms);

    // Verify cross-bus alert & motor cut
    TEST_ASSERT_TRUE(s.high_bus_rx.size() > high_bus_before);
    TEST_ASSERT_EQUAL(can::kIdSafetyEstop, s.high_bus_rx.back().id);
    TEST_ASSERT_EQUAL(RelayController::State::Off, s.mtr_relays.state());
    TEST_ASSERT_EQUAL(0, s.mtr_dac.current_code());
}

extern "C" void app_main() {
    UNITY_BEGIN();
    RUN_TEST(test_running_fault_estop_button_and_full_rearm_recovery);
    RUN_TEST(test_running_fault_sys_safety_crc_corruption_and_recovery);
    RUN_TEST(test_running_fault_mode_stream_counter_freeze_and_recovery);
    RUN_TEST(test_running_fault_power_stream_counter_jump_and_recovery);
    RUN_TEST(test_running_fault_steering_following_error_and_estop);
    RUN_TEST(test_running_fault_obstacle_collision_imminent_and_clearance);
    RUN_TEST(test_running_fault_actuator_l3_fault_estop);
    RUN_TEST(test_running_fault_dedicated_0x204_watchdog_and_3_frame_recovery);
    RUN_TEST(test_running_fault_sudden_reverse_inversion_guard_at_speed);
    RUN_TEST(test_running_fault_low_can_bus_off_cross_bus_alert);
    UNITY_END();
}

#if defined(HOST_BUILD) || defined(NATIVE_TEST_ENV) || !defined(ESP_PLATFORM)
int main(int argc, char **argv) {
    app_main();
    return 0;
}
#endif
